zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <module name="DMAC" id="04495" name2="dma_dmac_u2223_v2" version="v1">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="1" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="2" caption="Number of channels"/>
              <param name="EVIN_NUM" value="2" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="2" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="SPLIT_IRQ_NUM" value="0" caption="Number of IRQ split out"/>
              <param name="TRIG_BITS" value="5" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="23" caption="Number of peripheral triggers"/>
              <param name="INSTANCE_ID" value="35" caption="Instance index for DMAC"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="06333" name2="icd_dsu_arm_v1" version="v1">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <signals>
              <signal group="MSA" function="dsu_msa_alt" pad="PA21"/>
              <signal group="MSA" function="dsu_msa" pad="PA01"/>
              <signal group="SWCCSTAT" function="dsu_swccstat_alt" pad="PA21"/>
              <signal group="SWCCSTAT" function="dsu_swccstat" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_8W_ALT1" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_8W" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_4W_ALT3" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_4W_ALT2" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_4W_ALT1" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_4W" pad="PA01"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_1W_ALT1" pad="PA21"/>
              <signal group="TDTI_DATA" index="0" function="TDTI_1W" pad="PA01"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_8W_ALT1" pad="PA20"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_8W" pad="PA09"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_4W_ALT3" pad="PA20"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_4W_ALT2" pad="PA23"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_4W_ALT1" pad="PA20"/>
              <signal group="TDTI_DATA" index="1" function="TDTI_4W" pad="PA09"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_8W_ALT1" pad="PA31"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_8W" pad="PA10"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_4W_ALT3" pad="PA31"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_4W_ALT2" pad="PA22"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_4W_ALT1" pad="PA31"/>
              <signal group="TDTI_DATA" index="2" function="TDTI_4W" pad="PA10"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_8W_ALT1" pad="PA21"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_8W" pad="PA11"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_4W_ALT3" pad="PA23"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_4W_ALT2" pad="PA21"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_4W_ALT1" pad="PA21"/>
              <signal group="TDTI_DATA" index="3" function="TDTI_4W" pad="PA11"/>
              <signal group="TDTI_DATA" index="4" function="TDTI_8W_ALT1" pad="PA09"/>
              <signal group="TDTI_DATA" index="4" function="TDTI_8W" pad="PA04"/>
              <signal group="TDTI_DATA" index="5" function="TDTI_8W_ALT1" pad="PA10"/>
              <signal group="TDTI_DATA" index="5" function="TDTI_8W" pad="PA05"/>
              <signal group="TDTI_DATA" index="6" function="TDTI_8W_ALT1" pad="PA11"/>
              <signal group="TDTI_DATA" index="6" function="TDTI_8W" pad="PA06"/>
              <signal group="TDTI_DATA" index="7" function="TDTI_8W_ALT1" pad="PA23"/>
              <signal group="TDTI_DATA" index="7" function="TDTI_8W" pad="PA07"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DCC0" value="21" caption="Index of DMA DCC0 trigger"/>
              <param name="DMAC_ID_DCC1" value="22" caption="Index of DMA DCC1 trigger"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DSU"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" name2="U2254" version="v1">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="8" function="A" pad="PA08"/>
              <signal group="EXTINT" index="8" function="A" pad="PA24"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PA25"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="15" function="A" pad="PA31"/>
              <signal group="NMI" function="A" pad="PA01"/>
              <signal group="NMI" function="A" pad="PA07"/>
              <signal group="NMI" function="A" pad="PA30"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="0"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for EIC"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" name2="U2256" version="v1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="CHANNELS" value="4" caption="Number of Channels"/>
              <param name="CHANNELS_BITS" value="2" caption="Number of bits to select Channel"/>
              <param name="CHANNELS_MSB" value="3" caption="Number of Channels - 1"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="1" caption="Index of Generic Clocks 0"/>
              <param name="GCLK_ID_1" value="2" caption="Index of Generic Clocks 1"/>
              <param name="GCLK_ID_2" value="3" caption="Index of Generic Clocks 2"/>
              <param name="GCLK_ID_3" value="4" caption="Index of Generic Clocks 3"/>
              <param name="GENERATORS" value="62" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="6" caption="Number of bits to select Event Generator"/>
              <param name="USERS" value="23" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="5" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for EVSYS"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="06285" name2="pic32cm_pl10_fuses" version="v1">
          <instance name="FUSES">
            <register-group name="FUSES_BOOTCFG" name-in-module="FUSES_BOOTCFG" address-space="base" offset="0x0D000400"/>
            <register-group name="FUSES_SIGNATURE" name-in-module="FUSES_SIGNATURE" address-space="base" offset="0x0D000200"/>
