zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
      <value-group name="ADC_INPUTCTRL__MUXNEG">
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
        <value name="AIN16" caption="ADC AIN16 Pin" value="0x10"/>
        <value name="AIN17" caption="ADC AIN17 Pin" value="0x11"/>
        <value name="AIN18" caption="ADC AIN18 Pin" value="0x12"/>
        <value name="AIN19" caption="ADC AIN19 Pin" value="0x13"/>
        <value name="AIN20" caption="ADC AIN20 Pin" value="0x14"/>
        <value name="AIN21" caption="ADC AIN21 Pin" value="0x15"/>
        <value name="AIN22" caption="ADC AIN22 Pin" value="0x16"/>
        <value name="AIN23" caption="ADC AIN23 Pin" value="0x17"/>
        <value name="AIN24" caption="ADC AIN24 Pin" value="0x18"/>
        <value name="AIN25" caption="ADC AIN25 Pin" value="0x19"/>
        <value name="AIN26" caption="ADC AIN26 Pin" value="0x1A"/>
        <value name="AIN27" caption="ADC AIN27 Pin" value="0x1B"/>
        <value name="AIN28" caption="ADC AIN28 Pin" value="0x1C"/>
        <value name="AIN29" caption="ADC AIN29 Pin" value="0x1D"/>
        <value name="AIN31" caption="ADC AIN31 Pin" value="0x1F"/>
        <value name="AIN40" caption="ADC AIN40 Pin" value="0x28"/>
        <value name="AIN41" caption="ADC AIN41 Pin" value="0x29"/>
        <value name="AIN42" caption="ADC AIN42 Pin" value="0x2A"/>
        <value name="AIN43" caption="ADC AIN43 Pin" value="0x2B"/>
        <value name="AIN44" caption="ADC AIN44 Pin" value="0x2C"/>
        <value name="AIN45" caption="ADC AIN45 Pin" value="0x2D"/>
        <value name="AIN46" caption="ADC AIN46 Pin" value="0x2E"/>
        <value name="AIN47" caption="ADC AIN47 Pin" value="0x2F"/>
        <value name="GND" caption="Analog Ground" value="0x60"/>
        <value name="VREFP" caption="Positive Reference" value="0x61"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXPOS">
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
        <value name="AIN16" caption="ADC AIN16 Pin" value="0x10"/>
        <value name="AIN17" caption="ADC AIN17 Pin" value="0x11"/>
        <value name="AIN18" caption="ADC AIN18 Pin" value="0x12"/>
        <value name="AIN19" caption="ADC AIN19 Pin" value="0x13"/>
        <value name="AIN20" caption="ADC AIN20 Pin" value="0x14"/>
        <value name="AIN21" caption="ADC AIN21 Pin" value="0x15"/>
        <value name="AIN22" caption="ADC AIN22 Pin" value="0x16"/>
        <value name="AIN23" caption="ADC AIN23 Pin" value="0x17"/>
        <value name="AIN24" caption="ADC AIN24 Pin" value="0x18"/>
        <value name="AIN25" caption="ADC AIN25 Pin" value="0x19"/>
        <value name="AIN26" caption="ADC AIN26 Pin" value="0x1A"/>
        <value name="AIN27" caption="ADC AIN27 Pin" value="0x1B"/>
        <value name="AIN28" caption="ADC AIN28 Pin" value="0x1C"/>
        <value name="AIN29" caption="ADC AIN29 Pin" value="0x1D"/>
        <value name="AIN31" caption="ADC AIN31 Pin" value="0x1F"/>
        <value name="AIN40" caption="ADC AIN40 Pin" value="0x28"/>
        <value name="AIN41" caption="ADC AIN41 Pin" value="0x29"/>
        <value name="AIN42" caption="ADC AIN42 Pin" value="0x2A"/>
        <value name="AIN43" caption="ADC AIN43 Pin" value="0x2B"/>
        <value name="AIN44" caption="ADC AIN44 Pin" value="0x2C"/>
        <value name="AIN45" caption="ADC AIN45 Pin" value="0x2D"/>
        <value name="AIN46" caption="ADC AIN46 Pin" value="0x2E"/>
        <value name="AIN47" caption="ADC AIN47 Pin" value="0x2F"/>
        <value name="GND" caption="Analog Ground" value="0x60"/>
        <value name="VDDCOREDIV4" caption="1/4 Scaled Core Supply" value="0x61"/>
        <value name="TEMPSENSE" caption="Temperature Sensor" value="0x62"/>
        <value name="VDDIODIV10" caption="1/10 Scaled VDDIO Supply" value="0x64"/>
        <value name="VDDIO2DIV10" caption="1/10 Scaled VDDIO2 Supply" value="0x65"/>
        <value name="ACVREFSCALE0" caption="Output from AC VREFSCALE0" value="0x69"/>
        <value name="ACVREFSCALE1" caption="Output from AC VREFSCALE1" value="0x6A"/>
        <value name="TESTBUF" caption="Test Buffer" value="0x70"/>
        <value name="PTC" caption="PTC" value="0x7E"/>
      </value-group>
      <value-group name="ADC_COMMAND__START">
        <value name="STOP" caption="Stop an ongoing conversion" value="0x0"/>
        <value name="IMMEDIATE" caption="Start a conversion immediately. This bit will be reset to STOP when the conversion is complete, unless Free-Running mode is enabled." value="0x1"/>
        <value name="INPUT" caption="Start a conversion when a write to the INPUTCTRL register is performed" value="0x2"/>
        <value name="EVENT" caption="Start a conversion when an event is received by the ADC. This requires EVCTRL.STARTEI to be set to '1'." value="0x4"/>
      </value-group>
      <value-group name="ADC_COMMAND__MODE">
        <value name="NONE" caption="None" value="0x0"/>
        <value name="SINGLE" caption="Single conversion" value="0x1"/>
        <value name="SERIES" caption="Series mode with accumulation, using a separate trigger for each conversion" value="0x2"/>
        <value name="BURST" caption="Burst mode with accumulation. A single trigger will initiate the number of conversions configured by CTRLD.SAMPNUM in one sequence." value="0x3"/>
        <value name="ACCTEST" caption="Accumulator diagnostics mode" value="0x7"/>
      </value-group>
      <value-group name="ADC_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x414443"/>
      </value-group>
    </module>
    <module name="CCL" id="05277" name2="cla_ccl_apb_v1" version="v1" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
