zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Block Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
        <value name="CHN0" caption="DMA Channel 0" value="0x20"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x21"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_PRICTRL0__LVLPRIx">
        <value name="CHN0" caption="DMA Channel 0" value="0x00"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x01"/>
      </value-group>
      <value-group name="DMAC_INTPEND__ID">
        <value name="CHN0" caption="DMA Channel 0" value="0x00"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x01"/>
      </value-group>
      <value-group name="DMAC_ACTIVE__ID">
        <value name="CHN0" caption="DMA Channel 0" value="0x00"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x01"/>
      </value-group>
      <value-group name="DMAC_CHID__ID">
        <value name="CHN0" caption="DMA Channel 0" value="0x00"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x01"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="TRIG" caption="Normal transfer and conditional transfer on strobe trigger" value="0x1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4"/>
        <value name="RESUME" caption="Channel resume operation" value="0x5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__LVL">
        <value name="LVL0" caption="Channel priority level 0" value="0x0"/>
        <value name="LVL1" caption="Channel priority level 1" value="0x1"/>
        <value name="LVL2" caption="Channel priority level 2" value="0x2"/>
        <value name="LVL3" caption="Channel priority level 3" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00"/>
        <value name="SERCOM0_RX" caption="SERCOM0 RX Trigger" value="0x1"/>
        <value name="SERCOM0_TX" caption="SERCOM0 TX Trigger" value="0x2"/>
        <value name="SERCOM1_RX" caption="SERCOM1 RX Trigger" value="0x3"/>
        <value name="SERCOM1_TX" caption="SERCOM1 TX Trigger" value="0x4"/>
        <value name="TC0_OVF" caption="TC0 Overflow Trigger" value="0x5"/>
        <value name="TC0_MC0" caption="TC0 Match/Compare 0 Trigger" value="0x6"/>
        <value name="TC0_MC1" caption="TC0 Match/Compare 1 Trigger" value="0x7"/>
        <value name="TC1_OVF" caption="TC1 Overflow Trigger" value="0x8"/>
        <value name="TC1_MC0" caption="TC1 Match/Compare 0 Trigger" value="0x9"/>
        <value name="TC1_MC1" caption="TC1 Match/Compare 1 Trigger" value="0xA"/>
        <value name="TC2_OVF" caption="TC2 Overflow Trigger" value="0xB"/>
        <value name="TC2_MC0" caption="TC2 Match/Compare 0 Trigger" value="0xC"/>
        <value name="TC2_MC1" caption="TC2 Match/Compare 1 Trigger" value="0xD"/>
        <value name="TCC0_OVF" caption="TCC0 Overflow Trigger" value="0xE"/>
        <value name="TCC0_MC0" caption="TCC0 Match/Compare 0 Trigger" value="0xF"/>
        <value name="TCC0_MC1" caption="TCC0 Match/Compare 1 Trigger" value="0x10"/>
        <value name="TCC0_MC2" caption="TCC0 Match/Compare 2 Trigger" value="0x11"/>
        <value name="TCC0_MC3" caption="TCC0 Match/Compare 3 Trigger" value="0x12"/>
        <value name="ADC0_RESRDY" caption="ADC0 Restult Ready Trigger" value="0x13"/>
        <value name="ADC0_SAMPRDY" caption="ADC0 Sample Ready Trigger" value="0x14"/>
        <value name="DSU_DCC0" caption="DSU Debug Communication Channel 0" value="0x15"/>
        <value name="DSU_DCC1" caption="DSU Debug Communication Channel 1" value="0x16"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0"/>
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
