zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 5">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF"/>
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 6">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF"/>
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 7">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF"/>
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="CoreSight Peripheral Identification 0">
          <bitfield name="PART0" caption="CoreSight Part Number Bits" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="CoreSight Peripheral Identification 1">
          <bitfield name="PART1" caption="CoreSight Part Number Bits" mask="0xF"/>
          <bitfield name="DES0" caption="CoreSight JEP106 Identification Code Bits" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" caption="CoreSight Peripheral Identification 2">
          <bitfield name="DES1" caption="CoreSight JEP106 Identification Code Bits" mask="0x7"/>
          <bitfield name="JEDEC" caption="CoreSight JEDEC Assignment" mask="0x8"/>
          <bitfield name="REVISION" caption="CoreSight Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 3">
          <bitfield name="CMOD" caption="CoreSight Custom Modifier 0" mask="0xF"/>
          <bitfield name="REVAND" caption="CoreSight REVAND" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="CoreSight Component Identification 0">
          <bitfield name="PRMBL0" caption="CoreSight Preamble 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="CoreSight Component Identification 1">
          <bitfield name="PRMBL1" caption="CoreSight Preamble 1" mask="0xF"/>
          <bitfield name="CCLASS" caption="CoreSight Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="CoreSight Component Identification 2">
          <bitfield name="PRMBL2" caption="CoreSight Preamble 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="CoreSight Component Identification 3">
          <bitfield name="PRMBL3" caption="CoreSight Preamble 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DSU_CTRLB__DCCDMALVLx">
        <value name="EMPTY" caption="Trigger n rises when DCCn is read and falls when it is written" value="0x0"/>
        <value name="FULL" caption="Trigger n rises when DCCn is written and falls when it is read" value="0x1"/>
      </value-group>
      <value-group name="DSU_CTRLB__QOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive latency" value="0x2"/>
        <value name="HIGH" caption="Critical latency" value="0x3"/>
      </value-group>
      <value-group name="DSU_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x445355"/>
      </value-group>
      <value-group name="DSU_DAL__CPU0">
        <value name="SECURED" caption="The Debugger targeting the CPU0 domain can only access the DSU external address space; otherwise, debugger access is disabled." value="0x0"/>
        <value name="FULL_DEBUG" caption="The Debugger has unrestricted access" value="0x2"/>
      </value-group>
    </module>
    <module name="EIC" id="U2254" name2="U2254" version="v1" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="NMI Asynchronous Edge Detection Mode" mask="0x10"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO0" caption="External Interrupt Event Output Enable 0" mask="0x1"/>
          <bitfield name="EXTINTEO1" caption="External Interrupt Event Output Enable 1" mask="0x2"/>
          <bitfield name="EXTINTEO2" caption="External Interrupt Event Output Enable 2" mask="0x4"/>
          <bitfield name="EXTINTEO3" caption="External Interrupt Event Output Enable 3" mask="0x8"/>
          <bitfield name="EXTINTEO4" caption="External Interrupt Event Output Enable 4" mask="0x10"/>
          <bitfield name="EXTINTEO5" caption="External Interrupt Event Output Enable 5" mask="0x20"/>
          <bitfield name="EXTINTEO6" caption="External Interrupt Event Output Enable 6" mask="0x40"/>
          <bitfield name="EXTINTEO7" caption="External Interrupt Event Output Enable 7" mask="0x80"/>
          <bitfield name="EXTINTEO8" caption="External Interrupt Event Output Enable 8" mask="0x100"/>
          <bitfield name="EXTINTEO9" caption="External Interrupt Event Output Enable 9" mask="0x200"/>
          <bitfield name="EXTINTEO10" caption="External Interrupt Event Output Enable 10" mask="0x400"/>
          <bitfield name="EXTINTEO11" caption="External Interrupt Event Output Enable 11" mask="0x800"/>
          <bitfield name="EXTINTEO12" caption="External Interrupt Event Output Enable 12" mask="0x1000"/>
          <bitfield name="EXTINTEO13" caption="External Interrupt Event Output Enable 13" mask="0x2000"/>
          <bitfield name="EXTINTEO14" caption="External Interrupt Event Output Enable 14" mask="0x4000"/>
          <bitfield name="EXTINTEO15" caption="External Interrupt Event Output Enable 15" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT0" caption="External Interrupt Enable 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt Enable 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt Enable 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt Enable 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt Enable 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt Enable 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt Enable 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt Enable 7" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt Enable 8" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt Enable 9" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt Enable 10" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt Enable 11" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt Enable 15" mask="0x8000"/>
        </register>
