zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT0" caption="External Interrupt Enable 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt Enable 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt Enable 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt Enable 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt Enable 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt Enable 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt Enable 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt Enable 7" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt Enable 8" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt Enable 9" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt Enable 10" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt Enable 11" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt Enable 15" mask="0x8000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH0" caption="Asynchronous Edge Detection Mode 0" mask="0x1"/>
          <bitfield name="ASYNCH1" caption="Asynchronous Edge Detection Mode 1" mask="0x2"/>
          <bitfield name="ASYNCH2" caption="Asynchronous Edge Detection Mode 2" mask="0x4"/>
          <bitfield name="ASYNCH3" caption="Asynchronous Edge Detection Mode 3" mask="0x8"/>
          <bitfield name="ASYNCH4" caption="Asynchronous Edge Detection Mode 4" mask="0x10"/>
          <bitfield name="ASYNCH5" caption="Asynchronous Edge Detection Mode 5" mask="0x20"/>
          <bitfield name="ASYNCH6" caption="Asynchronous Edge Detection Mode 6" mask="0x40"/>
          <bitfield name="ASYNCH7" caption="Asynchronous Edge Detection Mode 7" mask="0x80"/>
          <bitfield name="ASYNCH8" caption="Asynchronous Edge Detection Mode 8" mask="0x100"/>
          <bitfield name="ASYNCH9" caption="Asynchronous Edge Detection Mode 9" mask="0x200"/>
          <bitfield name="ASYNCH10" caption="Asynchronous Edge Detection Mode 10" mask="0x400"/>
          <bitfield name="ASYNCH11" caption="Asynchronous Edge Detection Mode 11" mask="0x800"/>
          <bitfield name="ASYNCH12" caption="Asynchronous Edge Detection Mode 12" mask="0x1000"/>
          <bitfield name="ASYNCH13" caption="Asynchronous Edge Detection Mode 13" mask="0x2000"/>
          <bitfield name="ASYNCH14" caption="Asynchronous Edge Detection Mode 14" mask="0x4000"/>
          <bitfield name="ASYNCH15" caption="Asynchronous Edge Detection Mode 15" mask="0x8000"/>
        </register>
        <register name="CONFIG0" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration 0">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG0__SENSEx"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
        <register name="CONFIG1" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration 1">
          <bitfield name="SENSE8" caption="Input Sense Configuration 8" mask="0x7" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN8" caption="Filter Enable 8" mask="0x8"/>
          <bitfield name="SENSE9" caption="Input Sense Configuration 9" mask="0x70" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN9" caption="Filter Enable 9" mask="0x80"/>
          <bitfield name="SENSE10" caption="Input Sense Configuration 10" mask="0x700" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN10" caption="Filter Enable 10" mask="0x800"/>
          <bitfield name="SENSE11" caption="Input Sense Configuration 11" mask="0x7000" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN11" caption="Filter Enable 11" mask="0x8000"/>
          <bitfield name="SENSE12" caption="Input Sense Configuration 12" mask="0x70000" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN12" caption="Filter Enable 12" mask="0x80000"/>
          <bitfield name="SENSE13" caption="Input Sense Configuration 13" mask="0x700000" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN13" caption="Filter Enable 13" mask="0x800000"/>
          <bitfield name="SENSE14" caption="Input Sense Configuration 14" mask="0x7000000" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN14" caption="Filter Enable 14" mask="0x8000000"/>
          <bitfield name="SENSE15" caption="Input Sense Configuration 15" mask="0x70000000" values="EIC_CONFIG1__SENSEx"/>
          <bitfield name="FILTEN15" caption="Filter Enable 15" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="GCLK_EIC" caption="The EIC is clocked by GCLK_EIC" value="0x0"/>
        <value name="CLK_OSC32K" caption="The EIC is clocked by CLK_OSC32K" value="0x1"/>
      </value-group>
