zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="FLOW" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" caption="MTB Base"/>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" caption="MTB Integration Mode Control"/>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set"/>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear"/>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" caption="MTB Lock Access"/>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" caption="MTB Lock Status"/>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" caption="MTB Authentication Status"/>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" caption="MTB Device Architecture"/>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" caption="MTB Device Configuration"/>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" caption="MTB Device Type"/>
        <register name="PID4" offset="0xFD0" rw="R" size="4" caption="Peripheral Identification 4"/>
        <register name="PID5" offset="0xFD4" rw="R" size="4" caption="Peripheral Identification 5"/>
        <register name="PID6" offset="0xFD8" rw="R" size="4" caption="Peripheral Identification 6"/>
        <register name="PID7" offset="0xFDC" rw="R" size="4" caption="Peripheral Identification 7"/>
        <register name="PID0" offset="0xFE0" rw="R" size="4" caption="Peripheral Identification 0"/>
        <register name="PID1" offset="0xFE4" rw="R" size="4" caption="Peripheral Identification 1"/>
        <register name="PID2" offset="0xFE8" rw="R" size="4" caption="Peripheral Identification 2"/>
        <register name="PID3" offset="0xFEC" rw="R" size="4" caption="Peripheral Identification 3"/>
        <register name="CID0" offset="0xFF0" rw="R" size="4" caption="Component Identification 0"/>
        <register name="CID1" offset="0xFF4" rw="R" size="4" caption="Component Identification 1"/>
        <register name="CID2" offset="0xFF8" rw="R" size="4" caption="Component Identification 2"/>
        <register name="CID3" offset="0xFFC" rw="R" size="4" caption="Component Identification 3"/>
      </register-group>
    </module>
    <module name="NVIC" id="SYSTEM_IP" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Enable Register">
          <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0x7FFF"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0x7FFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0x7FFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0x7FFF"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" count="4" initval="0x00000000" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x3"/>
          <bitfield name="PRI1" caption="Priority of interrupt n" mask="0x300"/>
          <bitfield name="PRI2" caption="Priority of interrupt n" mask="0x30000"/>
          <bitfield name="PRI3" caption="Priority of interrupt n" mask="0x3000000"/>
        </register>
      </register-group>
    </module>
    <module name="NVMCTRL" id="06228" name2="nvm_ctrl_arm_v1" version="v1" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLB__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLB__CMDEX"/>
        </register>
        <register name="PARAM" offset="0x8" rw="R" size="4" caption="NVM Parameters">
          <bitfield name="NVMP" caption="NVM Parameters" mask="0xFFFF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x70000" values="NVMCTRL_PARAM__PSZ"/>
          <bitfield name="BOOTPROT" caption="Boot Section Size" mask="0x7000000" values="NVMCTRL_PARAM__BOOTPROT"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="READY" caption="NVM Ready" mask="0x1"/>
          <bitfield name="ERROR" caption="Error" mask="0x2"/>
        </register>
