zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="INTFLAGSET" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Software Set">
          <bitfield name="READY" caption="NVM Ready" mask="0x1"/>
          <bitfield name="ERROR" caption="Error" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Status">
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x8"/>
        </register>
        <register name="ADDR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="LOCK" offset="0x24" rw="R" size="4" caption="Lock Section">
          <bitfield name="LOCK0" caption="Region 0 Lock Bit" mask="0x1"/>
          <bitfield name="LOCK1" caption="Region 1 Lock Bit" mask="0x2"/>
          <bitfield name="LOCK2" caption="Region 2 Lock Bit" mask="0x4"/>
          <bitfield name="LOCK3" caption="Region 3 Lock Bit" mask="0x8"/>
          <bitfield name="LOCK4" caption="Region 4 Lock Bit" mask="0x10"/>
          <bitfield name="LOCK5" caption="Region 5 Lock Bit" mask="0x20"/>
          <bitfield name="LOCK6" caption="Region 6 Lock Bit" mask="0x40"/>
          <bitfield name="LOCK7" caption="Region 7 Lock Bit" mask="0x80"/>
          <bitfield name="LOCK8" caption="Region 8 Lock Bit" mask="0x100"/>
          <bitfield name="LOCK9" caption="Region 9 Lock Bit" mask="0x200"/>
          <bitfield name="LOCK10" caption="Region 10 Lock Bit" mask="0x400"/>
          <bitfield name="LOCK11" caption="Region 11 Lock Bit" mask="0x800"/>
          <bitfield name="LOCK12" caption="Region 12 Lock Bit" mask="0x1000"/>
          <bitfield name="LOCK13" caption="Region 13 Lock Bit" mask="0x2000"/>
          <bitfield name="LOCK14" caption="Region 14 Lock Bit" mask="0x4000"/>
          <bitfield name="LOCK15" caption="Region 15 Lock Bit" mask="0x8000"/>
        </register>
        <register name="DATA" offset="0x28" rw="R" size="4" caption="Read Data">
          <bitfield name="DATA" caption="Read Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="WPCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="NVMCTRL_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLB__CMD">
        <value name="NOCMD" caption="No command" value="0x00"/>
        <value name="NOOP" caption="No operation" value="0x01"/>
        <value name="FLWR" caption="Flash Write Enable" value="0x02"/>
        <value name="FLPER" caption="Flash Page Erase Enable" value="0x08"/>
        <value name="FLMPER2" caption="Flash 2-page Erase Enable" value="0x09"/>
        <value name="FLMPER4" caption="Flash 4-page Erase Enable" value="0x0A"/>
        <value name="FLMPER8" caption="Flash 8-page Erase Enable" value="0x0B"/>
        <value name="FLMPER16" caption="Flash 16-page Erase Enable" value="0x0C"/>
        <value name="FLMPER32" caption="Flash 32-page Erase Enable" value="0x0D"/>
        <value name="LR" caption="Lock Region. Sets the bit in the Region n Lock Bits bit field in the Lock Section register (NVMCTRL.LOCK) corresponding to the address location in the ADDR register." value="0x0E"/>
        <value name="UR" caption="Unlock Region. Clears the bit in NVMCTRL.LOCK corresponding to the address location in the ADDR register." value="0x0F"/>
        <value name="EBOOTCFG" caption="Erase BOOTCFG Page Enable" value="0x10"/>
        <value name="WBOOTCFG" caption="Write BOOTCFG Page Enable" value="0x11"/>
        <value name="WLOCKREGION" caption="Write Enable to ROMCFG.NVMLOCKREGION. Writes to other addresses will cause STATUS.PROGE to be set." value="0x12"/>
        <value name="WROMCFG" caption="Write ROMCFG Page Enable. The ROMCFG Page is used by the boot ROM to store Debug Access Level (DAL) bits and other security or protection bits for such as CEHL and Immutable boot." value="0x20"/>
        <value name="CHER" caption="Erase FlashRequires DAL == 2 or SYSINT privileges" value="0x21"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__CMDEX">
        <value name="KEY" caption="Execution key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__BOOTPROT">
        <value name="SIZE_32768BYTES" caption="32768 bytes are protected." value="0x0"/>
        <value name="SIZE_16384BYTES" caption="16384 bytes are protected." value="0x1"/>
        <value name="SIZE_8192BYTES" caption="8192 bytes are protected." value="0x2"/>
        <value name="SIZE_4096BYTES" caption="4096 bytes are protected." value="0x3"/>
        <value name="SIZE_2048BYTES" caption="2048 bytes are protected." value="0x4"/>
        <value name="SIZE_1024BYTES" caption="1024 bytes are protected." value="0x5"/>
        <value name="SIZE_512BYTES" caption="512 bytes are protected." value="0x6"/>
        <value name="SIZE_0BYTES" caption="0 bytes are protected." value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x4E564D"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="06251" name2="osc_32kctrl_arm_v1" version="v1" caption="32.768 kHz Oscillators Controller">
      <register-group name="OSC32KCTRL" caption="32.768 kHz Oscillators Controller">
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detection Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detection Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detected" mask="0x4"/>
        </register>
        <register name="INTFLAGSET" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Software Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detected" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detected" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock Switch" mask="0x8"/>
        </register>
        <register name="RTCCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="RTC Control">
          <bitfield name="RTCSEL" caption="RTC Clock Source Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32KCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000080" caption="XOSC32K Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="External Source Select" mask="0x4" values="OSC32KCTRL_XOSC32KCTRL__XTALEN"/>
          <bitfield name="ONDEMAND" caption="On-Demand Operation" mask="0x80"/>
          <bitfield name="CSUT" caption="Crystal Oscillator Start-Up Time" mask="0x300" values="OSC32KCTRL_XOSC32KCTRL__CSUT"/>
          <bitfield name="LPMODE" caption="Low Power Mode" mask="0x2000"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80000000"/>
        </register>
        <register name="CFDCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
          <bitfield name="SWBACK" caption="Clock Switch Back Enable" mask="0x2"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4"/>
        </register>
        <register name="EVCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSC32KCTRL" offset="0x28" rw="RW" size="4" initval="0x00000080" caption="32.768 kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ONDEMAND" caption="On-Demand Operation" mask="0x80"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80000000"/>
        </register>
        <register name="WPCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="OSC32KCTRL_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="OSC1K" caption="1.024 kHz from the internal 32.768 kHz oscillator" value="0x2"/>
        <value name="OSC32K" caption="32.768 kHz from the internal 32.768 kHz oscillator" value="0x3"/>
        <value name="XOSC1K" caption="1.024 kHz from the external 32.768 kHz crystal oscillator" value="0x4"/>
        <value name="XOSC32K" caption="32.768 kHz from the external 32.768 kHz crystal oscillator" value="0x5"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32KCTRL__XTALEN">
        <value name="EXTCLK" caption="External Clock on the XTAL32K1 pin. XTAL32K2 is available for other functions. The CSUT timer is disregarded, and no start-up time is used." value="0x0"/>
        <value name="XTAL" caption="External Crystal connected to the XTAL32K1 and XTAL32K2 pins" value="0x1"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32KCTRL__CSUT">
        <value name="1K" caption="1K XOSC32K cycles" value="0x0"/>
        <value name="16K" caption="16K XOSC32K cycles" value="0x1"/>
        <value name="32K" caption="32K XOSC32K cycles" value="0x2"/>
        <value name="64K" caption="64K XOSC32K cycles" value="0x3"/>
      </value-group>
