zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
        <register name="DBGCTRL" offset="0xE" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register modes="MODE0" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE0 Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="Frequency Correction Synchronization Busy" mask="0x4"/>
          <bitfield name="COUNT" caption="Counter Value Synchronization Busy" mask="0x8"/>
          <bitfield name="COMP0" caption="Compare 0 Value Synchronization Busy" mask="0x20"/>
          <bitfield name="COUNTSYNC" caption="COUNT Read Resynchronization Enable Synchronization Busy" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE1 Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="Frequency Correction Synchronization Busy" mask="0x4"/>
          <bitfield name="COUNT" caption="Counter Value Synchronization Busy" mask="0x8"/>
          <bitfield name="PER" caption="Counter Period Synchronization Busy" mask="0x10"/>
          <bitfield name="COMP0" caption="Compare 0 Value Synchronization Busy" mask="0x20"/>
          <bitfield name="COMP1" caption="Compare 1 Value Synchronization Busy" mask="0x40"/>
          <bitfield name="COUNTSYNC" caption="COUNT Read Resynchronization Enable Synchronization Busy" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE2 Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="Frequency Correction Synchronization Busy" mask="0x4"/>
          <bitfield name="CLOCK" caption="Clock Value Synchronization Busy" mask="0x8"/>
          <bitfield name="ALARM0" caption="Alarm 0 Value Synchronization Busy" mask="0x20"/>
          <bitfield name="MASK0" caption="Alarm 0 Mask Synchronization Busy" mask="0x800"/>
          <bitfield name="CLOCKSYNC" caption="CLOCK Read Resynchronization Enable Synchronization Busy" mask="0x8000"/>
        </register>
        <register name="FREQCORR" offset="0x14" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Frequency Correction">
          <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
          <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
        </register>
        <register modes="MODE0" name="COUNT" offset="0x18" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE0 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="COUNT" offset="0x18" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="CLOCK" offset="0x18" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2 Clock Value">
          <mode name="CLK12H" qualifier="RTC.CTRLA.CLKREP" value="1" caption="12 Hour Clock Format"/>
          <mode name="CLK24H" qualifier="RTC.CTRLA.CLKREP" value="0" caption="24 Hour Clock Format"/>
          <mode name="DEFAULT"/>
          <bitfield modes="DEFAULT" name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield modes="DEFAULT" name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield modes="CLK12H" name="HOUR" caption="Hour" mask="0xF000"/>
          <bitfield modes="CLK12H" name="INDICATOR" caption="Meridiem Indicator" mask="0x10000" values="RTC_MODE2_CLOCK__INDICATOR"/>
          <bitfield modes="CLK24H" name="HOUR" caption="Hour" mask="0x1F000"/>
          <bitfield modes="DEFAULT" name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield modes="DEFAULT" name="MONTH" caption="Month" mask="0x3C00000" values="RTC_MODE2_CLOCK__MONTH"/>
          <bitfield modes="DEFAULT" name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE1" name="PER" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Counter Period">
          <bitfield name="PER" caption="Counter Period" mask="0xFFFF"/>
        </register>
        <register modes="MODE0" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE0 Compare # Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="2" count="2" initval="0x0000" caption="MODE1 Compare # Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="ALARM0" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2 Alarm 0 Value">
          <mode name="CLK12H" qualifier="RTC.CTRLA.CLKREP" value="1" caption="12 Hour Clock Format"/>
          <mode name="CLK24H" qualifier="RTC.CTRLA.CLKREP" value="0" caption="24 Hour Clock Format"/>
          <mode name="DEFAULT"/>
          <bitfield modes="DEFAULT" name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield modes="DEFAULT" name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield modes="CLK12H" name="HOUR" caption="Hour" mask="0xF000"/>
          <bitfield modes="CLK12H" name="INDICATOR" caption="Meridiem Indicator" mask="0x10000" values="RTC_MODE2_ALARMx__INDICATOR"/>
          <bitfield modes="CLK24H" name="HOUR" caption="Hour" mask="0x1F000"/>
          <bitfield modes="DEFAULT" name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield modes="DEFAULT" name="MONTH" caption="Month" mask="0x3C00000" values="RTC_MODE2_ALARMx__MONTH"/>
          <bitfield modes="DEFAULT" name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE2" name="MASK0" offset="0x24" rw="RW" access="WSYNC" size="1" initval="0x00" caption="MODE2 Alarm 0 Mask">
          <bitfield name="SEL" caption="Alarm Mask Selection" mask="0x7" values="RTC_MODE2_MASKx__SEL"/>
        </register>
      </register-group>
      <value-group name="RTC_MODE0_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__CLKREP">
        <value name="CLK24H" caption="24 hour clock format" value="0x0"/>
        <value name="CLK12H" caption="12 hour (AM/PM) clock format" value="0x1"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE2_CLOCK__INDICATOR">
        <value name="AM" caption="Before midday (AM)" value="0x0"/>
        <value name="PM" caption="After midday (PM)" value="0x1"/>
      </value-group>
