zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
      <value-group name="RTC_MODE2_CLOCK__MONTH">
        <value name="JAN" caption="January" value="0x1"/>
        <value name="FEB" caption="February" value="0x2"/>
        <value name="MAR" caption="March" value="0x3"/>
        <value name="APR" caption="April" value="0x4"/>
        <value name="MAY" caption="May" value="0x5"/>
        <value name="JUN" caption="June" value="0x6"/>
        <value name="JUL" caption="July" value="0x7"/>
        <value name="AUG" caption="August" value="0x8"/>
        <value name="SEP" caption="September" value="0x9"/>
        <value name="OCT" caption="October" value="0xA"/>
        <value name="NOV" caption="November" value="0xB"/>
        <value name="DEC" caption="December" value="0xC"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARMx__INDICATOR">
        <value name="AM" caption="Before midday (AM)" value="0x0"/>
        <value name="PM" caption="After midday (PM)" value="0x1"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARMx__MONTH">
        <value name="JAN" caption="January" value="0x1"/>
        <value name="FEB" caption="February" value="0x2"/>
        <value name="MAR" caption="March" value="0x3"/>
        <value name="APR" caption="April" value="0x4"/>
        <value name="MAY" caption="May" value="0x5"/>
        <value name="JUN" caption="June" value="0x6"/>
        <value name="JUL" caption="July" value="0x7"/>
        <value name="AUG" caption="August" value="0x8"/>
        <value name="SEP" caption="September" value="0x9"/>
        <value name="OCT" caption="October" value="0xA"/>
        <value name="NOV" caption="November" value="0xB"/>
        <value name="DEC" caption="December" value="0xC"/>
      </value-group>
      <value-group name="RTC_MODE2_MASKx__SEL">
        <value name="OFF" caption="Alarm Disabled" value="0x0"/>
        <value name="SS" caption="Match seconds only" value="0x1"/>
        <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
        <value name="HHMMSS" caption="Match seconds, minutes, and hours only" value="0x3"/>
        <value name="DDHHMMSS" caption="Match seconds, minutes, hours, and days only" value="0x4"/>
        <value name="MMDDHHMMSS" caption="Match seconds, minutes, hours, days, and months only" value="0x5"/>
        <value name="YYMMDDHHMMSS" caption="Match seconds, minutes, hours, days, months, and years" value="0x6"/>
      </value-group>
    </module>
    <module name="SERCOM" id="U2201" name2="U2201" version="v1" caption="Serial Communication Interface">
      <register-group name="SERCOM" caption="Serial Communication Interface">
        <mode name="I2CM" qualifier="SERCOM.I2CM.CTRLA.MODE" value="5" caption="I2C Host Mode"/>
        <mode name="I2CS" qualifier="SERCOM.I2CS.CTRLA.MODE" value="4" caption="I2C Client Mode"/>
        <mode name="SPI" qualifier="SERCOM.SPI.CTRLA.MODE" mask="6" value="2" caption="SPI Mode"/>
        <mode name="USART" qualifier="SERCOM.USART.CTRLA.MODE" mask="6" value="0" caption="USART Mode"/>
        <register modes="I2CM" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_I2CM_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000" values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
          <bitfield name="MEXTTOEN" caption="Host SCL Low Extend Time-Out" mask="0x400000"/>
          <bitfield name="SEXTTOEN" caption="Client SCL Low Extend Time-Out" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000" values="SERCOM_I2CM_CTRLA__SPEED"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="INACTOUT" caption="Inactive Time-Out" mask="0x30000000" values="SERCOM_I2CM_CTRLA__INACTOUT"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Time-Out" mask="0x40000000"/>
        </register>
        <register modes="I2CS" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CS Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_I2CS_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000" values="SERCOM_I2CS_CTRLA__SDAHOLD"/>
          <bitfield name="SEXTTOEN" caption="Client SCL Low Extend Time-Out" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000" values="SERCOM_I2CS_CTRLA__SPEED"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Time-Out" mask="0x40000000"/>
        </register>
        <register modes="SPI" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPI Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_SPI_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="DOPO" caption="Data Out Pinout" mask="0x30000" values="SERCOM_SPI_CTRLA__DOPO"/>
          <bitfield name="DIPO" caption="Data In Pinout" mask="0x300000" values="SERCOM_SPI_CTRLA__DIPO"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_SPI_CTRLA__FORM"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x10000000" values="SERCOM_SPI_CTRLA__CPHA"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_SPI_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_SPI_CTRLA__DORD"/>
        </register>
