zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
      <value-group name="SERCOM_SPI_CTRLA__CPHA">
        <value name="LEADING_EDGE" caption="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" value="0x0"/>
        <value name="TRAILING_EDGE" caption="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="SCK is low when IDLE. The leading edge of a clock cycle is a rising edge, while the trailing edge is a falling edge." value="0x0"/>
        <value name="IDLE_HIGH" caption="SCK is high when IDLE. The leading edge of a clock cycle is a falling edge, while the trailing edge is a rising edge." value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__DORD">
        <value name="MSB" caption="MSb is transferred first" value="0x0"/>
        <value name="LSB" caption="LSb is transferred first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI Client mode" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI Host mode" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C Client mode" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C Host mode" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPR">
        <value name="16X_ARITHMETIC" caption="16x over-sampling using arithmetic baud rate generation" value="0x0"/>
        <value name="16X_FRACTIONAL" caption="16x over-sampling using fractional baud rate generation" value="0x1"/>
        <value name="8X_ARITHMETIC" caption="8x over-sampling using arithmetic baud rate generation" value="0x2"/>
        <value name="8X_FRACTIONAL" caption="8x over-sampling using fractional baud rate generation" value="0x3"/>
        <value name="3X_ARITHMETIC" caption="3x over-sampling using arithmetic baud rate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="MUX0" caption="PAD[0]=TxD, PAD[1]=XCK" value="0x0"/>
        <value name="MUX1" caption="PAD[2]=TxD, PAD[3]=XCK" value="0x1"/>
        <value name="MUX2" caption="PAD[0]=TxD, PAD[2]=RTS/TE, PAD[3]=CTS" value="0x2"/>
        <value name="MUX3" caption="PAD[0]=TxD, PAD[1]=XCK, PAD[2]=RTS/TE" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="MUX0" caption="SERCOM PAD[0] is used for data reception" value="0x0"/>
        <value name="MUX1" caption="SERCOM PAD[1] is used for data reception" value="0x1"/>
        <value name="MUX2" caption="SERCOM PAD[2] is used for data reception" value="0x2"/>
        <value name="MUX3" caption="SERCOM PAD[3] is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPA">
        <value name="ADJ0" caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5" value="0x0"/>
        <value name="ADJ1" caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6" value="0x1"/>
        <value name="ADJ2" caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7" value="0x2"/>
        <value name="ADJ3" caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
        <value name="USART_FRAME_WITH_PARITY" caption="USART frame with parity" value="0x1"/>
        <value name="USART_FRAME_LINBRKGEN" caption="LIN Host - Break and sync generation. See LIN Command (CTRLB.LINCMD)." value="0x2"/>
        <value name="USART_FRAME_AUTO_BAUD_NO_PARITY" caption="Auto-baud (LIN Client) - break detection and auto-baud" value="0x4"/>
        <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY" caption="Auto-baud - break detection and auto-baud with parity" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CMODE">
        <value name="ASYNC" caption="Asynchronous communication" value="0x0"/>
        <value name="SYNC" caption="Synchronous communication" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="TxD Change: Rising XCK edge, RxD Sample: Falling XCK edge" value="0x0"/>
        <value name="IDLE_HIGH" caption="TxD Change: Falling XCK edge, RxD Sample: Rising XCK edge" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__DORD">
        <value name="MSB" caption="MSb is transferred first" value="0x0"/>
        <value name="LSB" caption="LSb is transferred first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLB__AMODE">
        <value name="MASK" caption="The client responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK. See SERCOM - Serial Communication Interface for additional information." value="0x0"/>
        <value name="2ADDRS" caption="The client responds to the two unique addresses in ADDR.ADDR and ADDR.ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The client responds to the range of addresses between and including ADDR.ADDR and ADDR.ADDRMASK. ADDR.ADDR is the upper limit." value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLB__CHSIZE">
        <value name="8_BIT" caption="Eight bits" value="0x0"/>
        <value name="9_BIT" caption="Nine bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLB__AMODE">
        <value name="MASK" caption="ADDRMASK is used as a mask to the ADDR register" value="0x0"/>
        <value name="2ADDRS" caption="The client responds to the two unique addresses in ADDR and ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The client responds to the range of addresses between and including ADDR and ADDRMASK with ADDR as the upper limit" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8-bits character" value="0x0"/>
        <value name="9_BIT" caption="9-bits character" value="0x1"/>
        <value name="5_BIT" caption="5-bits character" value="0x5"/>
        <value name="6_BIT" caption="6-bits character" value="0x6"/>
        <value name="7_BIT" caption="7-bits character" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One stop bit" value="0x0"/>
        <value name="2_BIT" caption="Two stop bits" value="0x1"/>
      </value-group>
