zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10028.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated at the beginning of each counter cycle" value="0x0"/>
        <value name="END" caption="An interrupt/event is generated at the end of each counter cycle" value="0x1"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated at the beginning of the first counter cycle, and at the end of last counter cycle" value="0x3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal Frequency" value="0x0"/>
        <value name="MFRQ" caption="Match Frequency" value="0x1"/>
        <value name="NPWM" caption="Normal PWM" value="0x2"/>
        <value name="DPWM" caption="Dual Compare PWM" value="0x3"/>
        <value name="DSCRITICAL" caption="Dual-slope PWM" value="0x4"/>
        <value name="DSBOTTOM" caption="Dual-slope PWM" value="0x5"/>
        <value name="DSBOTH" caption="Dual-slope PWM" value="0x6"/>
        <value name="DSTOP" caption="Dual-slope PWM" value="0x7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0x0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="0x1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="0x2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="0x3"/>
      </value-group>
      <value-group name="TCC_WAVE_DUALCOMPARE__POLx">
        <value name="NORMAL" caption="Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value." value="0x0"/>
        <value name="INVERTED" caption="Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value." value="0x1"/>
      </value-group>
      <value-group name="TCC_WAVE_DUALSLOPE__POLx">
        <value name="NORMAL" caption="Compare output is set to ~DIR when TCC counter matches CCn value" value="0x0"/>
        <value name="INVERTED" caption="Compare output is set to DIR when TCC counter matches CCn value." value="0x1"/>
      </value-group>
      <value-group name="TCC_WAVE_SINGLESLOPE__POLx">
        <value name="NORMAL" caption="Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value." value="0x0"/>
        <value name="INVERTED" caption="Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value." value="0x1"/>
      </value-group>
    </module>
    <module name="WDT" id="U2251" name2="U2251" version="v1" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="WDT_CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="WDT_CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" caption="Early Warning Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="WDT_EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="ALWAYSON Synchronization Busy" mask="0x8"/>
          <bitfield name="CLEAR" caption="CLEAR Synchronization Busy" mask="0x10"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="WDT_CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
